In [1]:
cd ..

/Users/didac.fortuny/Didac/repos/ddc/godatathon_2020

In [2]:
import pandas as pd

from src.utils import save_dataset

# Settings

In [3]:
DATASET_PATH = "data/clean/dataset_complete.csv"

# Read data

In [4]:
dataset = pd.read_csv(DATASET_PATH)
dataset.head(2)

,provided,submission,country,brand,volume,month_num,num_generics,package_CREAM,package_EYE_DROP,package_INHALER,...,brand_90,brand_91,brand_92,brand_93,brand_94,brand_95,brand_96,brand_97,brand_98,brand_99
0,True,False,country_1,brand_10,6088874.84,-47,6,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,True,False,country_1,brand_10,6658654.12,-46,6,0,0,0,...,0,0,0,0,0,0,0,0,0,0

## Filter columns

In [5]:
dataset = dataset[["month_num", "volume", "country", "brand"]]
dataset.head(2)

   month_num      volume    country     brand
0        -47  6088874.84  country_1  brand_10
1        -46  6658654.12  country_1  brand_10

# Normalize

In [6]:
dataset_means = dataset[["country", "brand", "volume"]].groupby(["country", "brand"], as_index=False).max()
dataset_means = dataset_means.rename(columns={"volume": "volume_max"})
dataset_means.head(2)

     country      brand   volume_max
0  country_1   brand_10   8296237.56
1  country_1  brand_102  32989198.48

In [7]:
dataset = dataset.merge(dataset_means, on=["country", "brand"], how="left")
dataset.head(2)

   month_num      volume    country     brand  volume_max
0        -47  6088874.84  country_1  brand_10  8296237.56
1        -46  6658654.12  country_1  brand_10  8296237.56

In [8]:
dataset["volume_rel"] = dataset["volume"] / dataset["volume_max"]
dataset.head(2)

   month_num      volume    country     brand  volume_max  volume_rel
0        -47  6088874.84  country_1  brand_10  8296237.56    0.733932
1        -46  6658654.12  country_1  brand_10  8296237.56    0.802611

In [9]:
save_dataset(dataset, "data/temp", "relative_volumes.csv")